"""
**Завдання 1: Робота з функціями**

Створіть Python-файл з ім'ям `calculator.py`. У цьому файлі створіть наступні функції:

1. `add(a, b)`: Приймає два числа `a` і `b` та повертає їхню суму.
2. `subtract(a, b)`: Приймає два числа `a` і `b` та повертає їхню різницю.
3. `multiply(a, b)`: Приймає два числа `a` і `b` та повертає їхній добуток.
4. `divide(a, b)`: Приймає два числа `a` і `b` і повертає результат ділення `a` на `b`.
 Пам'ятайте про можливість ділення на нуль і додайте перевірку цього варіанту.

Після створення цих функцій, напишіть програму, яка імпортує модуль `calculator.py` і
 використовує його функції для виконання обчислень. Попросіть користувача ввести два числа і
  операцію (додавання, віднімання, множення або ділення), і виведіть результат обчислення.
"""
import calculator as calc
print('Вітаю, це калькулятор базових операцій!')
num1 = float(input("Введіть перше число: "))
num2 = float(input("Введіть друге число: "))
while True:
    print("\nОберіть операцію:")
    print("1. Додавання")
    print("2. Віднімання")
    print("3. Множення")
    print("4. Ділення")
    print("0. Вихід")

    choice = input("Введіть номер операції (1/2/3/4) або 0 для виходу: ")

    match choice:
        case "1":
            print(f"Результат додавання: {calc.add(num1, num2)}")
        case "2":
            print(f"Результат віднімання: {calc.subtract(num1, num2)}")
        case "3":
            print(f"Результат множення: {calc.multiply(num1, num2)}")
        case "4":
            print(f"Результат ділення: {calc.divide(num1, num2)}")
        case "0":
            print("Вихід з програми")
            break
        case _:
            print("Некоректний вибір, спробуйте ще раз.")

"""
Друге завдання зроблене в директорії module
"""